RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_adc.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check the adc periph */
#define NOT_ADC_PERIPH(adc_periph)                      (((adc_periph) != ADC0) && ((adc_periph) != ADC1) && \
                                                        ((adc_periph) != ADC2))

/* check the adc prescaler ratio */
#define NOT_ADC_CLK_MODE(prescaler)                     (((prescaler) != ADC_CLK_SYNC_HCLK_DIV2)  && ((prescaler) != ADC_CLK_SYNC_HCLK_DIV4) && \
                                                         ((prescaler) != ADC_CLK_SYNC_HCLK_DIV6)  && ((prescaler) != ADC_CLK_SYNC_HCLK_DIV8) && \
                                                         ((prescaler) != ADC_CLK_SYNC_HCLK_DIV10) && ((prescaler) != ADC_CLK_SYNC_HCLK_DIV12) && \
                                                         ((prescaler) != ADC_CLK_SYNC_HCLK_DIV14) && ((prescaler) != ADC_CLK_SYNC_HCLK_DIV16) && \
                                                         ((prescaler) != ADC_CLK_ASYNC_DIV1)      && ((prescaler) != ADC_CLK_ASYNC_DIV2) && \
                                                         ((prescaler) != ADC_CLK_ASYNC_DIV4)      && ((prescaler) != ADC_CLK_ASYNC_DIV6) && \
                                                         ((prescaler) != ADC_CLK_ASYNC_DIV8)      && ((prescaler) != ADC_CLK_ASYNC_DIV10) && \
                                                         ((prescaler) != ADC_CLK_ASYNC_DIV12)     && ((prescaler) != ADC_CLK_ASYNC_DIV16) && \
                                                         ((prescaler) != ADC_CLK_ASYNC_DIV32)     && ((prescaler) != ADC_CLK_ASYNC_DIV64) && \
                                                         ((prescaler) != ADC_CLK_ASYNC_DIV128)    && ((prescaler) != ADC_CLK_ASYNC_DIV256))

/* check adc special mode */
#define ADC_SPECIAL_FUNCTION_LOW                        ((uint32_t)0x00000002U)
#define ADC_SPECIAL_FUNCTION_HIGH                       ((uint32_t)0x00000502U)
#define NOT_ADC_SPECIAL_FUNCTION_VALUE(function)        ((ADC_SPECIAL_FUNCTION_LOW > (function)) || (ADC_SPECIAL_FUNCTION_HIGH < (function)))

/* check ENABLE and DISABLE */
#define NOT_ADC_ENABLE_DISABLE(newvalue)                (((newvalue) != ENABLE)  && ((newvalue) != DISABLE))

/* check data alignment */
#define NOT_ADC_DATA_ALIGNMENT(data_alignment)          (((data_alignment) != ADC_DATAALIGN_RIGHT) && ((data_alignment) != ADC_DATAALIGN_LEFT))

/* check adc calibration mode */
#define NOT_CALIBRATION_MODE(clb_mode)                  (((clb_mode) != ADC_CALIBRATION_OFFSET_MISMATCH) && ((clb_mode) != ADC_CALIBRATION_OFFSET))

/* check adc calibration number */
#define NOT_ADC_CALIBRATION_NUMBER(clb_num)             (((clb_num) != ADC_CALIBRATION_NUM1)  && ((clb_num) != ADC_CALIBRATION_NUM2) && \
                                                        ((clb_num) != ADC_CALIBRATION_NUM4)  && ((clb_num) != ADC_CALIBRATION_NUM8) && \
                                                        ((clb_num) != ADC_CALIBRATION_NUM16) && ((clb_num) != ADC_CALIBRATION_NUM32))

/* check ADC resolution */
#define NOT_ADC_RESOLUTION(resolution)                  (((resolution) != ADC_RESOLUTION_14B) && ((resolution) != ADC_RESOLUTION_12B) && ((resolution) \
                                                        != ADC_RESOLUTION_10B) && ((resolution) != ADC_RESOLUTION_8B)  && ((resolution) != ADC_RESOLUTION_6B))

/* check ADC resolution */
#define NOT_ADC_CHANNEL_INTERNAL(internal_channel)      (((internal_channel) != ADC_CHANNEL_INTERNAL_TEMPSENSOR)    && ((internal_channel) != ADC_CHANNEL_INTERNAL_VREFINT) && \
                                                        ((internal_channel) != ADC_CHANNEL_INTERNAL_VBAT)          && ((internal_channel) != ADC_CHANNEL_INTERNAL_HP_TEMPSENSOR))

/* check ADC sequence */
#define NOT_ADC_SEQUENCE(adc_sequence)                  (((adc_sequence) != ADC_ROUTINE_CHANNEL)  && ((adc_sequence) != ADC_INSERTED_CHANNEL))

/* check discontinuous mode length */
#define ADC_DISCONTINUOUS_MODE_LENGTH_LOW               ((uint32_t)0x00000001U)
#define ADC_DISCONTINUOUS_MODE_LENGTH_HIGH              ((uint32_t)0x00000008U)
#define NOT_ADC_DISCONTINUOUS_MODE_LENGTH(length)       ((ADC_DISCONTINUOUS_MODE_LENGTH_LOW > (length)) || (ADC_DISCONTINUOUS_MODE_LENGTH_HIGH < (length)))

/* check ADC sequence */
#define NOT_ADC_SEQUENCE(adc_sequence)                  (((adc_sequence) != ADC_ROUTINE_CHANNEL)  && ((adc_sequence) != ADC_INSERTED_CHANNEL))

/* check ADC sequence */
#define NOT_ADC_SEQUENCE_EXD(adc_sequence)              (((adc_sequence) != ADC_ROUTINE_CHANNEL)  && ((adc_sequence) != ADC_INSERTED_CHANNEL)&& ((adc_sequence) != ADC_CHANNEL_DISCON_DISABLE))

/* check ADC channel length */
#define ADC_CHANNEL_LENGTH_LOW                          ((uint32_t)0x00000001U)
#define ADC_CHANNEL_LENGTH_HIGH                         ((uint32_t)0x00000010U)
#define NOT_ADC_CHANNEL_LENGTH(length)                  ((ADC_CHANNEL_LENGTH_LOW > (length)) || (ADC_CHANNEL_LENGTH_HIGH < (length)))

/* check routine sequence rank */
#define ADC_ROUTINE_SEQUENCE_RANK_HIGH                  ((uint32_t)0x0000000FU)
#define NOT_ADC_ROUTINE_SEQUENCE_RANK_VALUE(rank)       (ADC_ROUTINE_SEQUENCE_RANK_HIGH < (rank))

/* check ADC channel select */
#define NOT_ADC_CHANNEL(channel)                        (((channel) != ADC_CHANNEL_0)  && ((channel) != ADC_CHANNEL_1) && \
                                                        ((channel) != ADC_CHANNEL_2) && ((channel) != ADC_CHANNEL_3) && \
                                                        ((channel) != ADC_CHANNEL_4) && ((channel) != ADC_CHANNEL_5) && \
                                                        ((channel) != ADC_CHANNEL_6) && ((channel) != ADC_CHANNEL_7) && \
                                                        ((channel) != ADC_CHANNEL_8) && ((channel) != ADC_CHANNEL_9) && \
                                                        ((channel) != ADC_CHANNEL_10) && ((channel) != ADC_CHANNEL_11) && \
                                                        ((channel) != ADC_CHANNEL_12) && ((channel) != ADC_CHANNEL_13) && \
                                                        ((channel) != ADC_CHANNEL_14) && ((channel) != ADC_CHANNEL_15) && \
                                                        ((channel) != ADC_CHANNEL_16) && ((channel) != ADC_CHANNEL_17) && \
                                                        ((channel) != ADC_CHANNEL_18) && ((channel) != ADC_CHANNEL_19) && \
                                                        ((channel) != ADC_CHANNEL_20))

