RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_adc.h
/* check ADC sample_time */
#define ADC_ADC_SAMPLE_TIME_HIGH                        ((uint32_t)0x00000329U)
#define NOT_ADC_SAMPLE_TIME(sample_time)                (ADC_ADC_SAMPLE_TIME_HIGH < (sample_time))

/* check inserted sequence rank */
#define ADC_INSERTED_SEQUENCE_RANK_HIGH                 ((uint32_t)0x00000003U)
#define NOT_ADC_INSERTED_SEQUENCE_RANK_VALUE(rank)      (ADC_INSERTED_SEQUENCE_RANK_HIGH < (rank))

/* check inserted channel */
#define NOT_INSERTED_CHANNEL(inserted_channel)          (((inserted_channel) != ADC_INSERTED_CHANNEL_0) && ((inserted_channel) != ADC_INSERTED_CHANNEL_1) && \
                                                        ((inserted_channel) != ADC_INSERTED_CHANNEL_2) && ((inserted_channel) != ADC_INSERTED_CHANNEL_3))

/* check inserted offset value */
#define ADC_INSERTED_OFFSET_HIGH                        ((uint32_t)0x00FFFFFFU)
#define NOT_ADC_INSERTED_OFFSET_VALUE(offset)           (ADC_INSERTED_OFFSET_HIGH < (offset))

/* check ADC trigger mode */
#define NOT_ADC_TRIGGER_MODE(trigger_mode)              (((trigger_mode) != EXTERNAL_TRIGGER_DISABLE) && ((trigger_mode) != EXTERNAL_TRIGGER_RISING) && \
                                                         ((trigger_mode) != EXTERNAL_TRIGGER_FALLING) && ((trigger_mode) != EXTERNAL_TRIGGER_RISING_FALLING))

/* end of conversion mode */
#define NOT_ADC_END_OF_CONVERSION_MODE(end_selection)   (((end_selection) != ADC_EOC_SET_SEQUENCE) && ((end_selection) != ADC_EOC_SET_CONVERSION))

/* check ADC sequence */
#define NOT_ADC_SEQUENC_BOTH(adc_sequence)              (((adc_sequence) != ADC_ROUTINE_CHANNEL) && ((adc_sequence) != ADC_INSERTED_CHANNEL) && \
                                                        ((adc_sequence) != ADC_ROUTINE_INSERTED_CHANNEL))
                                                        
/* check differential mode for ADC channel */
#define ADC_DIFFERENTIAL_MODE_CHANNEL_LOW               ((uint32_t)0x00000001U)
#define ADC_DIFFERENTIAL_MODE_CHANNEL_HIGH              ((uint32_t)0x003FFFFFU)
#define NOT_ADC_DIFFERENTIAL_MODE_CHANNEL(length)       ((ADC_DIFFERENTIAL_MODE_CHANNEL_LOW > (length)) || (ADC_DIFFERENTIAL_MODE_CHANNEL_HIGH < (length)))

/* check ADC analog watchdog 1/2 selection */
#define ADC_ANALOG_WATCHDOG_SEL_LOW                     ((uint32_t)0x00000001U)
#define ADC_ANALOG_WATCHDOG_SEL_HIGH                    ((uint32_t)0x001FFFFFU)
#define NOT_ADC_ANALOG_WATCHDOG_SEL(selection_channel)  ((ADC_ANALOG_WATCHDOG_SEL_LOW > (selection_channel)) || (ADC_ANALOG_WATCHDOG_SEL_HIGH < (selection_channel)))


/* check analog watchdog threshold */
#define ADC_ANALOG_WATCHDOG_THRESHOLD_HIGH              ((uint32_t)0x00FFFFFFU)
#define NOT_ADC_ANALOG_WATCHDOG_THRESHOLD(threshold)    (ADC_ANALOG_WATCHDOG_THRESHOLD_HIGH < (threshold))

/* check ADC oversampling mode */
#define NOT_ADC_OVERSAMPLING_MODE(mode)                 (((mode) != ADC_OVERSAMPLING_ALL_CONVERT) && ((mode) != ADC_OVERSAMPLING_ONE_CONVERT))

/* check ADC oversampling shift */
#define NOT_ADC_OVERSAMPLING_SHIFT(shift)               (((shift) != ADC_OVERSAMPLING_SHIFT_NONE) && ((shift) != ADC_OVERSAMPLING_SHIFT_1B) && \
                                                        ((shift) != ADC_OVERSAMPLING_SHIFT_2B) && ((shift) != ADC_OVERSAMPLING_SHIFT_3B) && \
                                                        ((shift) != ADC_OVERSAMPLING_SHIFT_4B) && ((shift) != ADC_OVERSAMPLING_SHIFT_5B) && \
                                                        ((shift) != ADC_OVERSAMPLING_SHIFT_6B) && ((shift) != ADC_OVERSAMPLING_SHIFT_7B) && \
                                                        ((shift) != ADC_OVERSAMPLING_SHIFT_8B) && ((shift) != ADC_OVERSAMPLING_SHIFT_9B) && \
                                                        ((shift) != ADC_OVERSAMPLING_SHIFT_10B) && ((shift) != ADC_OVERSAMPLING_SHIFT_11B))

/* check ADC oversampling ratio */
#define ADC_OVERSAMPLING_RATIO_HIGH                    ((uint32_t)0x000003FFU)
#define NOT_ADC_OVERSAMPLING_RATIO(ratio)              (ADC_OVERSAMPLING_RATIO_HIGH < (ratio))

/* check ADC falg */
#define NOT_ADC_FLAG(flag)                             (((flag) != ADC_FLAG_WDE0) && ((flag) != ADC_FLAG_EOC) && \
                                                       ((flag) != ADC_FLAG_EOIC) && ((flag) != ADC_FLAG_STIC) && \
                                                       ((flag) != ADC_FLAG_STRC) && ((flag) != ADC_FLAG_ROVF) && \
                                                       ((flag) != ADC_FLAG_WDE1) && ((flag) != ADC_FLAG_WDE2))

/* check ADC interrupt */
#define NOT_ADC_INTERRUPT(interrupt)                   (((interrupt) != ADC_INT_WDE0) && ((interrupt) != ADC_INT_EOC) && \
                                                       ((interrupt) != ADC_INT_EOIC) && ((interrupt) != ADC_INT_ROVF) && \
                                                       ((interrupt) != ADC_INT_WDE1) && ((interrupt) != ADC_INT_WDE2))

/* check ADC interrupt flag */
#define NOT_ADC_INTERRUPT_FLAG(flag)                   (((int_flag) != ADC_INT_FLAG_WDE0) && ((int_flag) != ADC_INT_FLAG_EOC) && \
                                                       ((int_flag) != ADC_INT_FLAG_EOIC) && ((int_flag) != ADC_INT_FLAG_ROVF) && \
                                                       ((int_flag) != ADC_INT_FLAG_WDE1) && ((int_flag) != ADC_INT_FLAG_WDE2))

/* check the adc sync mode */
#define NOT_ADC_SYNC_mode(sync_mode)                   (((sync_mode) != ADC_SYNC_MODE_INDEPENDENT) && ((sync_mode) != ADC_DAUL_ROUTINE_PARALLEL_INSERTED_PARALLEL) && \
                                                       ((sync_mode) != ADC_DAUL_ROUTINE_PARALLEL_INSERTED_ROTATION) && ((sync_mode) != ADC_DAUL_INSERTED_PARALLEL) && \
                                                       ((sync_mode) != ADC_DAUL_ROUTINE_PARALLEL) && ((sync_mode) != ADC_DAUL_ROUTINE_FOLLOW_UP) && \
                                                       ((sync_mode) != ADC_DAUL_INSERTED_TRIGGER_ROTATION))

/* check the adc sync delay sample */
#define NOT_ADC_SYNC_DELAY_SAMPLE(sample_delay)        (((sample_delay) != ADC_SYNC_DELAY_5CYCLE)  && ((sample_delay) != ADC_SYNC_DELAY_6CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_7CYCLE)  && ((sample_delay) != ADC_SYNC_DELAY_8CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_9CYCLE)  && ((sample_delay) != ADC_SYNC_DELAY_10CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_11CYCLE) && ((sample_delay) != ADC_SYNC_DELAY_12CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_13CYCLE) && ((sample_delay) != ADC_SYNC_DELAY_14CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_15CYCLE) && ((sample_delay) != ADC_SYNC_DELAY_16CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_17CYCLE) && ((sample_delay) != ADC_SYNC_DELAY_18CYCLE) && \
                                                        ((sample_delay) != ADC_SYNC_DELAY_19CYCLE) && ((sample_delay) != ADC_SYNC_DELAY_20CYCLE))

/* check the adc sync dma mode */
#define NOT_ADC_SYNC_DMA_mode(dma_mode)                (((dma_mode) != ADC_SYNC_DMA_DISABLE) && ((dma_mode) != ADC_SYNC_DMA_MODE0) && \
                                                       ((dma_mode) != ADC_SYNC_DMA_MODE1))

